XYZUtils.asUnitOrZero(XYZUtils.XYZ!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Convert the input xyz into a unit vector.
IF the vector cannot be made a unit vector
THEN the function will return std::nullopt.